cases/chpt2-IF-interface/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 -0.01 0)
    (10 -0.01 0)
    (10 0.01 0)
    (0 0.01 0)
    (0 -0.01 10)
    (10 -0.01 10)
    (10 0.01 10)
    (0 0.01 10)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) allZone (250 1 250) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    leftWall
    {
        type wall;
        faces
        (
        (0 4 7 3)      
        );
    }
    rightWall
    {
        type wall;
        faces
        (
        (2 6 5 1)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
        (0 3 2 1)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
        (4 5 6 7)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
        (3 7 6 2)
        (1 5 4 0)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
