cases/chpt2-IF-interface/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    leftWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          250;
        startFace       124500;
    }
    rightWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          250;
        startFace       124750;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          250;
        startFace       125000;
    }
    atmosphere
    {
        type            patch;
        nFaces          250;
        startFace       125250;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          125000;
        startFace       125500;
    }
)

// ************************************************************************* //
